zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz1038ca70144.h
/**
 * \brief Header file for PIC32CZ1038CA70144
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ1038CA70144_H_
#define _PIC32CZ1038CA70144_H_

/** \addtogroup PIC32CZ1038CA70144_definitions PIC32CZ1038CA70144 definitions
  This file defines all structures and symbols for PIC32CZ1038CA70144:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
 *  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif

#include <stdint.h>

#define CAST(type, value) ((type *)(value)) /**< Pointer Type Conversion Macro for C/C++ */
#define VCAST(type, value) ((volatile type *)(value)) /**< Volatile Pointer Type Conversion Macro for C/C++ */

/** \addtogroup PIC32CZ1038CA70144_cmsis CMSIS Definitions
 *  @{
 */
/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR PIC32CZ1038CA70144                                 */
/* ************************************************************************** */
/** Interrupt Number Definition */
typedef enum IRQn
{
/******  CORTEX-M7 Processor Exceptions Numbers ******************************/
  Reset_IRQn                = -15, /**< 1   Reset Vector, invoked on Power up and warm reset  */
  NonMaskableInt_IRQn       = -14, /**< 2   Non maskable Interrupt, cannot be stopped or preempted  */
  HardFault_IRQn            = -13, /**< 3   Hard Fault, all classes of Fault     */
  MemoryManagement_IRQn     = -12, /**< 4   Memory Management, MPU mismatch, including Access Violation and No Match  */
  BusFault_IRQn             = -11, /**< 5   Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault  */
  UsageFault_IRQn           = -10, /**< 6   Usage Fault, i.e. Undef Instruction, Illegal State Transition  */
  SVCall_IRQn               = -5 , /**< 11  System Service Call via SVC instruction  */
  DebugMonitor_IRQn         = -4 , /**< 12  Debug Monitor                        */
  PendSV_IRQn               = -2 , /**< 14  Pendable request for system service  */
  SysTick_IRQn              = -1 , /**< 15  System Tick Timer                    */
/******  PIC32CZ1038CA70144 specific Interrupt Numbers ***********************************/
  SUPC_IRQn                 = 0  , /**< 0   Supply Controller (SUPC)            */
  RSTC_IRQn                 = 1  , /**< 1   Reset Controller (RSTC)             */
  RTC_IRQn                  = 2  , /**< 2   Real-time Clock (RTC)               */
  RTT_IRQn                  = 3  , /**< 3   Real-time Timer (RTT)               */
  WDT_IRQn                  = 4  , /**< 4   Watchdog Timer (WDT)                */
  PMC_IRQn                  = 5  , /**< 5   Power Management Controller (PMC)   */
  EFC_IRQn                  = 6  , /**< 6   Embedded Flash Controller (EFC)     */
  UART0_IRQn                = 7  , /**< 7   Universal Asynchronous Receiver Transmitter (UART0) */
  UART1_IRQn                = 8  , /**< 8   Universal Asynchronous Receiver Transmitter (UART1) */
  PORTA_IRQn                = 10 , /**< 10  Port (PORTA)                        */
  PORTB_IRQn                = 11 , /**< 11  Port (PORTB)                        */
  PORTC_IRQn                = 12 , /**< 12  Port (PORTC)                        */
  USART0_IRQn               = 13 , /**< 13  Universal Synchronous Asynchronous Receiver Transmitter (USART0) */
  USART1_IRQn               = 14 , /**< 14  Universal Synchronous Asynchronous Receiver Transmitter (USART1) */
  USART2_IRQn               = 15 , /**< 15  Universal Synchronous Asynchronous Receiver Transmitter (USART2) */
  PORTD_IRQn                = 16 , /**< 16  Port (PORTD)                        */
  PORTE_IRQn                = 17 , /**< 17  Port (PORTE)                        */
  HSMCI_IRQn                = 18 , /**< 18  High Speed MultiMedia Card Interface (HSMCI) */
  TWI0_IRQn                 = 19 , /**< 19  Two-wire Interface (TWI0)           */
  TWI1_IRQn                 = 20 , /**< 20  Two-wire Interface (TWI1)           */
  SPI0_IRQn                 = 21 , /**< 21  Serial Peripheral Interface (SPI0)  */
  SSC_IRQn                  = 22 , /**< 22  Synchronous Serial Controller (SSC) */
  TC0_CH0_IRQn              = 23 , /**< 23  Timer/Counter 0 Channel 0 (TC0)     */
  TC0_CH1_IRQn              = 24 , /**< 24  Timer/Counter 0 Channel 1 (TC0)     */
  TC0_CH2_IRQn              = 25 , /**< 25  Timer/Counter 0 Channel 2 (TC0)     */
  TC1_CH0_IRQn              = 26 , /**< 26  Timer/Counter 1 Channel 0 (TC1)     */
  TC1_CH1_IRQn              = 27 , /**< 27  Timer/Counter 1 Channel 1 (TC1)     */
  TC1_CH2_IRQn              = 28 , /**< 28  Timer/Counter 1 Channel 2 (TC1)     */
  AFEC0_IRQn                = 29 , /**< 29  Analog Front-End Controller (AFEC0) */
  DACC_IRQn                 = 30 , /**< 30  Digital-to-Analog Converter Controller (DACC) */
  PWMC0_IRQn                = 31 , /**< 31  Pulse Width Modulation Controller (PWMC0) */
  ICM_IRQn                  = 32 , /**< 32  Integrity Check Monitor (ICM)       */
  ACC_IRQn                  = 33 , /**< 33  Analog Comparator Controller (ACC)  */
  USBHS_IRQn                = 34 , /**< 34  USB High-Speed Interface (USBHS)    */
  MCAN0_IRQn                = 35 , /**< 35  Controller Area Network (MCAN0)     */
  MCAN1_IRQn                = 37 , /**< 37  Controller Area Network (MCAN1)     */
  GMAC_IRQn                 = 39 , /**< 39  Gigabit Ethernet MAC (GMAC)         */
  AFEC1_IRQn                = 40 , /**< 40  Analog Front-End Controller (AFEC1) */
  TWI2_IRQn                 = 41 , /**< 41  Two-wire Interface (TWI2)           */
  SPI1_IRQn                 = 42 , /**< 42  Serial Peripheral Interface (SPI1)  */
  QSPI_IRQn                 = 43 , /**< 43  Quad Serial Peripheral Interface (QSPI) */
  UART2_IRQn                = 44 , /**< 44  Universal Asynchronous Receiver Transmitter (UART2) */
  UART3_IRQn                = 45 , /**< 45  Universal Asynchronous Receiver Transmitter (UART3) */
  UART4_IRQn                = 46 , /**< 46  Universal Asynchronous Receiver Transmitter (UART4) */
  TC2_CH0_IRQn              = 47 , /**< 47  Timer/Counter 2 Channel 0 (TC2)     */
  TC2_CH1_IRQn              = 48 , /**< 48  Timer/Counter 2 Channel 1 (TC2)     */
  TC2_CH2_IRQn              = 49 , /**< 49  Timer/Counter 2 Channel 2 (TC2)     */
  TC3_CH0_IRQn              = 50 , /**< 50  Timer/Counter 3 Channel 0 (TC3)     */
  TC3_CH1_IRQn              = 51 , /**< 51  Timer/Counter 3 Channel 1 (TC3)     */
  TC3_CH2_IRQn              = 52 , /**< 52  Timer/Counter 3 Channel 2 (TC3)     */
  MLB_IRQn                  = 53 , /**< 53  MediaLB (MLB)                       */
  AES_IRQn                  = 56 , /**< 56  Advanced Encryption Standard (AES)  */
  TRNG_IRQn                 = 57 , /**< 57  True Random Number Generator (TRNG) */
  XDMAC_IRQn                = 58 , /**< 58  Extensible DMA Controller (XDMAC)   */
  ISI_IRQn                  = 59 , /**< 59  Image Sensor Interface (ISI)        */
  PWMC1_IRQn                = 60 , /**< 60  Pulse Width Modulation Controller (PWMC1) */
  RSWDT_IRQn                = 63 , /**< 63  Reinforced Safety Watchdog Timer (RSWDT) */
  I2SC0_IRQn                = 69 , /**< 69  Inter-IC Sound Controller (I2SC0)   */
  I2SC1_IRQn                = 70 , /**< 70  Inter-IC Sound Controller (I2SC1)   */
  SDRAMC_IRQn               = 62 , /**< 62  SDRAM Controller (SDRAMC)           */

