zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz1038ca70144.h
/** \addtogroup PIC32CZ1038CA70144_base Peripheral Base Address Definitions
 *  @{
 */

/* ************************************************************************** */
/*   REGISTER STRUCTURE ADDRESS DEFINITIONS FOR PIC32CZ1038CA70144            */
/* ************************************************************************** */
#define _ACC_REGS                        CAST(acc_registers_t, 0x40044000)             /**< \brief ACC Registers Address        */
#define _AES_REGS                        CAST(aes_registers_t, 0x4006c000)             /**< \brief AES Registers Address        */
#define _AFEC0_REGS                      CAST(afec_registers_t, 0x4003c000)            /**< \brief AFEC0 Registers Address      */
#define _AFEC1_REGS                      CAST(afec_registers_t, 0x40064000)            /**< \brief AFEC1 Registers Address      */
#define _CHIPID_REGS                     CAST(chipid_registers_t, 0x400e0940)          /**< \brief CHIPID Registers Address     */
#define _DACC_REGS                       CAST(dacc_registers_t, 0x40040000)            /**< \brief DACC Registers Address       */
#define _EFC_REGS                        CAST(efc_registers_t, 0x400e0c00)             /**< \brief EFC Registers Address        */
#define _GMAC_REGS                       CAST(gmac_registers_t, 0x40050000)            /**< \brief GMAC Registers Address       */
#define _GPBR_REGS                       CAST(gpbr_registers_t, 0x400e1890)            /**< \brief GPBR Registers Address       */
#define _HSMCI_REGS                      CAST(hsmci_registers_t, 0x40000000)           /**< \brief HSMCI Registers Address      */
#define _I2SC0_REGS                      CAST(i2sc_registers_t, 0x4008c000)            /**< \brief I2SC0 Registers Address      */
#define _I2SC1_REGS                      CAST(i2sc_registers_t, 0x40090000)            /**< \brief I2SC1 Registers Address      */
#define _ICM_REGS                        CAST(icm_registers_t, 0x40048000)             /**< \brief ICM Registers Address        */
#define _ISI_REGS                        CAST(isi_registers_t, 0x4004c000)             /**< \brief ISI Registers Address        */
#define _MATRIX_REGS                     CAST(matrix_registers_t, 0x40088000)          /**< \brief MATRIX Registers Address     */
#define _MCAN0_REGS                      CAST(mcan_registers_t, 0x40030000)            /**< \brief MCAN0 Registers Address      */
#define _MCAN1_REGS                      CAST(mcan_registers_t, 0x40034000)            /**< \brief MCAN1 Registers Address      */
#define _MLB_REGS                        CAST(mlb_registers_t, 0x40068000)             /**< \brief MLB Registers Address        */
#define _PORTA_REGS                      CAST(port_registers_t, 0x400e0e00)            /**< \brief PORTA Registers Address      */
#define _PORTB_REGS                      CAST(port_registers_t, 0x400e1000)            /**< \brief PORTB Registers Address      */
#define _PORTC_REGS                      CAST(port_registers_t, 0x400e1200)            /**< \brief PORTC Registers Address      */
#define _PORTD_REGS                      CAST(port_registers_t, 0x400e1400)            /**< \brief PORTD Registers Address      */
#define _PORTE_REGS                      CAST(port_registers_t, 0x400e1600)            /**< \brief PORTE Registers Address      */
#define _PMC_REGS                        CAST(pmc_registers_t, 0x400e0600)             /**< \brief PMC Registers Address        */
#define _PWMC0_REGS                      CAST(pwmc_registers_t, 0x40020000)            /**< \brief PWMC0 Registers Address      */
#define _PWMC1_REGS                      CAST(pwmc_registers_t, 0x4005c000)            /**< \brief PWMC1 Registers Address      */
#define _QSPI_REGS                       CAST(qspi_registers_t, 0x4007c000)            /**< \brief QSPI Registers Address       */
#define _RSTC_REGS                       CAST(rstc_registers_t, 0x400e1800)            /**< \brief RSTC Registers Address       */
#define _RSWDT_REGS                      CAST(rswdt_registers_t, 0x400e1900)           /**< \brief RSWDT Registers Address      */
#define _RTC_REGS                        CAST(rtc_registers_t, 0x400e1860)             /**< \brief RTC Registers Address        */
#define _RTT_REGS                        CAST(rtt_registers_t, 0x400e1830)             /**< \brief RTT Registers Address        */
#define _SDRAMC_REGS                     CAST(sdramc_registers_t, 0x40084000)          /**< \brief SDRAMC Registers Address     */
#define _SMC_REGS                        CAST(smc_registers_t, 0x40080000)             /**< \brief SMC Registers Address        */
#define _SPI0_REGS                       CAST(spi_registers_t, 0x40008000)             /**< \brief SPI0 Registers Address       */
#define _SPI1_REGS                       CAST(spi_registers_t, 0x40058000)             /**< \brief SPI1 Registers Address       */
#define _SSC_REGS                        CAST(ssc_registers_t, 0x40004000)             /**< \brief SSC Registers Address        */
#define _SUPC_REGS                       CAST(supc_registers_t, 0x400e1810)            /**< \brief SUPC Registers Address       */
#define _TC0_REGS                        CAST(tc_registers_t, 0x4000c000)              /**< \brief TC0 Registers Address        */
#define _TC1_REGS                        CAST(tc_registers_t, 0x40010000)              /**< \brief TC1 Registers Address        */
#define _TC2_REGS                        CAST(tc_registers_t, 0x40014000)              /**< \brief TC2 Registers Address        */
#define _TC3_REGS                        CAST(tc_registers_t, 0x40054000)              /**< \brief TC3 Registers Address        */
#define _TRNG_REGS                       CAST(trng_registers_t, 0x40070000)            /**< \brief TRNG Registers Address       */
#define _TWI0_REGS                       CAST(twi_registers_t, 0x40018000)             /**< \brief TWI0 Registers Address       */
#define _TWI1_REGS                       CAST(twi_registers_t, 0x4001c000)             /**< \brief TWI1 Registers Address       */
#define _TWI2_REGS                       CAST(twi_registers_t, 0x40060000)             /**< \brief TWI2 Registers Address       */
#define _UART0_REGS                      CAST(uart_registers_t, 0x400e0800)            /**< \brief UART0 Registers Address      */
#define _UART1_REGS                      CAST(uart_registers_t, 0x400e0a00)            /**< \brief UART1 Registers Address      */
#define _UART2_REGS                      CAST(uart_registers_t, 0x400e1a00)            /**< \brief UART2 Registers Address      */
#define _UART3_REGS                      CAST(uart_registers_t, 0x400e1c00)            /**< \brief UART3 Registers Address      */
#define _UART4_REGS                      CAST(uart_registers_t, 0x400e1e00)            /**< \brief UART4 Registers Address      */
#define _USART0_REGS                     CAST(usart_registers_t, 0x40024000)           /**< \brief USART0 Registers Address     */
#define _USART1_REGS                     CAST(usart_registers_t, 0x40028000)           /**< \brief USART1 Registers Address     */
#define _USART2_REGS                     CAST(usart_registers_t, 0x4002c000)           /**< \brief USART2 Registers Address     */
#define _USBHS_REGS                      CAST(usbhs_registers_t, 0x40038000)           /**< \brief USBHS Registers Address      */
#define _UTMI_REGS                       CAST(utmi_registers_t, 0x400e0400)            /**< \brief UTMI Registers Address       */
#define _WDT_REGS                        CAST(wdt_registers_t, 0x400e1850)             /**< \brief WDT Registers Address        */
#define _XDMAC_REGS                      CAST(xdmac_registers_t, 0x40078000)           /**< \brief XDMAC Registers Address      */

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CZ1038CA70144                          */
/* ************************************************************************** */

#define _ACC_BASE_ADDRESS                (0x40044000UL)                                /**< \brief ACC Base Address             */
#define _AES_BASE_ADDRESS                (0x4006c000UL)                                /**< \brief AES Base Address             */
#define _AFEC0_BASE_ADDRESS              (0x4003c000UL)                                /**< \brief AFEC0 Base Address           */
#define _AFEC1_BASE_ADDRESS              (0x40064000UL)                                /**< \brief AFEC1 Base Address           */
#define _CHIPID_BASE_ADDRESS             (0x400e0940UL)                                /**< \brief CHIPID Base Address          */
#define _DACC_BASE_ADDRESS               (0x40040000UL)                                /**< \brief DACC Base Address            */
#define _EFC_BASE_ADDRESS                (0x400e0c00UL)                                /**< \brief EFC Base Address             */
#define _GMAC_BASE_ADDRESS               (0x40050000UL)                                /**< \brief GMAC Base Address            */
#define _GPBR_BASE_ADDRESS               (0x400e1890UL)                                /**< \brief GPBR Base Address            */
#define _HSMCI_BASE_ADDRESS              (0x40000000UL)                                /**< \brief HSMCI Base Address           */
#define _I2SC0_BASE_ADDRESS              (0x4008c000UL)                                /**< \brief I2SC0 Base Address           */
#define _I2SC1_BASE_ADDRESS              (0x40090000UL)                                /**< \brief I2SC1 Base Address           */
#define _ICM_BASE_ADDRESS                (0x40048000UL)                                /**< \brief ICM Base Address             */
#define _ISI_BASE_ADDRESS                (0x4004c000UL)                                /**< \brief ISI Base Address             */
#define _MATRIX_BASE_ADDRESS             (0x40088000UL)                                /**< \brief MATRIX Base Address          */
#define _MCAN0_BASE_ADDRESS              (0x40030000UL)                                /**< \brief MCAN0 Base Address           */
#define _MCAN1_BASE_ADDRESS              (0x40034000UL)                                /**< \brief MCAN1 Base Address           */
#define _MLB_BASE_ADDRESS                (0x40068000UL)                                /**< \brief MLB Base Address             */
#define _PORTA_BASE_ADDRESS              (0x400e0e00UL)                                /**< \brief PORTA Base Address           */
#define _PORTB_BASE_ADDRESS              (0x400e1000UL)                                /**< \brief PORTB Base Address           */
#define _PORTC_BASE_ADDRESS              (0x400e1200UL)                                /**< \brief PORTC Base Address           */
#define _PORTD_BASE_ADDRESS              (0x400e1400UL)                                /**< \brief PORTD Base Address           */
#define _PORTE_BASE_ADDRESS              (0x400e1600UL)                                /**< \brief PORTE Base Address           */
#define _PMC_BASE_ADDRESS                (0x400e0600UL)                                /**< \brief PMC Base Address             */
#define _PWMC0_BASE_ADDRESS              (0x40020000UL)                                /**< \brief PWMC0 Base Address           */
#define _PWMC1_BASE_ADDRESS              (0x4005c000UL)                                /**< \brief PWMC1 Base Address           */
#define _QSPI_BASE_ADDRESS               (0x4007c000UL)                                /**< \brief QSPI Base Address            */
#define _RSTC_BASE_ADDRESS               (0x400e1800UL)                                /**< \brief RSTC Base Address            */
#define _RSWDT_BASE_ADDRESS              (0x400e1900UL)                                /**< \brief RSWDT Base Address           */
#define _RTC_BASE_ADDRESS                (0x400e1860UL)                                /**< \brief RTC Base Address             */
#define _RTT_BASE_ADDRESS                (0x400e1830UL)                                /**< \brief RTT Base Address             */
#define _SDRAMC_BASE_ADDRESS             (0x40084000UL)                                /**< \brief SDRAMC Base Address          */
#define _SMC_BASE_ADDRESS                (0x40080000UL)                                /**< \brief SMC Base Address             */
#define _SPI0_BASE_ADDRESS               (0x40008000UL)                                /**< \brief SPI0 Base Address            */
#define _SPI1_BASE_ADDRESS               (0x40058000UL)                                /**< \brief SPI1 Base Address            */
#define _SSC_BASE_ADDRESS                (0x40004000UL)                                /**< \brief SSC Base Address             */
#define _SUPC_BASE_ADDRESS               (0x400e1810UL)                                /**< \brief SUPC Base Address            */
#define _TC0_BASE_ADDRESS                (0x4000c000UL)                                /**< \brief TC0 Base Address             */
#define _TC1_BASE_ADDRESS                (0x40010000UL)                                /**< \brief TC1 Base Address             */
#define _TC2_BASE_ADDRESS                (0x40014000UL)                                /**< \brief TC2 Base Address             */
#define _TC3_BASE_ADDRESS                (0x40054000UL)                                /**< \brief TC3 Base Address             */
#define _TRNG_BASE_ADDRESS               (0x40070000UL)                                /**< \brief TRNG Base Address            */
#define _TWI0_BASE_ADDRESS               (0x40018000UL)                                /**< \brief TWI0 Base Address            */
#define _TWI1_BASE_ADDRESS               (0x4001c000UL)                                /**< \brief TWI1 Base Address            */
#define _TWI2_BASE_ADDRESS               (0x40060000UL)                                /**< \brief TWI2 Base Address            */
#define _UART0_BASE_ADDRESS              (0x400e0800UL)                                /**< \brief UART0 Base Address           */
#define _UART1_BASE_ADDRESS              (0x400e0a00UL)                                /**< \brief UART1 Base Address           */
#define _UART2_BASE_ADDRESS              (0x400e1a00UL)                                /**< \brief UART2 Base Address           */
#define _UART3_BASE_ADDRESS              (0x400e1c00UL)                                /**< \brief UART3 Base Address           */
#define _UART4_BASE_ADDRESS              (0x400e1e00UL)                                /**< \brief UART4 Base Address           */
#define _USART0_BASE_ADDRESS             (0x40024000UL)                                /**< \brief USART0 Base Address          */
#define _USART1_BASE_ADDRESS             (0x40028000UL)                                /**< \brief USART1 Base Address          */
#define _USART2_BASE_ADDRESS             (0x4002c000UL)                                /**< \brief USART2 Base Address          */
#define _USBHS_BASE_ADDRESS              (0x40038000UL)                                /**< \brief USBHS Base Address           */
#define _UTMI_BASE_ADDRESS               (0x400e0400UL)                                /**< \brief UTMI Base Address            */
#define _WDT_BASE_ADDRESS                (0x400e1850UL)                                /**< \brief WDT Base Address             */
#define _XDMAC_BASE_ADDRESS              (0x40078000UL)                                /**< \brief XDMAC Base Address           */

/* ************************************************************************** */
/*   HARMONY MODULES DEFINITIONS FOR PIC32CZ1038CA70144                       */
/* ************************************************************************** */

